

#include <iostream>
#include <math.h>

using namespace std;

int main()
{
  setlocale(LC_ALL, "RUSSIAN");
  int aw, a, x1, x2, b, u, y, del_y;
  double at, atw, m, d1, d2, dw1, dw2, da1, da2, df1, df2, z1, z2, tan_at;

  cout << "Введите по порядку:" << endl;
  cout << "Межосевое расстояние aw: ";
  cin >> aw;
  
  cout << "Угол наклона линии зуба по делительному цилиндру косозубой передачи: ";
  cin >> b;

  cout << "Коэфф. смещения шестерни x1: ";
  cin >> x1;

  cout << "Передаточное число u: ";
  cin >> u;
  cout << "\n\n";


  if ((aw <= 150) || (aw >= 250))
    cout << "Неверный ввод aw" << endl;
  if ((b <= 0) || (b >= 40))
    cout << "Неверный ввод b" << endl;
  if ((x1 != 0) && (x1 != 0.3))
    cout << "Неверный ввод x1" << endl;
  if (u != 3 && u != 4 && u != 6 && u != 8)
    cout << "Неверный ввод u" << endl;


  x2 = (-1) * x1;
  a = aw;
  m = 0.01 * aw;
  z1 = 2 * aw * cos(b) / (m * (u + 1));
  z1 = int(z1) + 1;
  z2 = z1 * u;
  z2 = int(z2) + 1;
  d1 = 2 * aw / (u + 1);
  dw1 = d1;
  dw2 = 2 * aw * u / (u + 1);
  d2 = dw2;
  tan_at = tan(20) / cos(b);
  at = atan(tan_at);
  atw = at;
  y = 0;
  del_y = 0;
  da1 = d1 + 2 * (1 + x1 - del_y);
  da2 = d2 + 2 * (1 + x2 - y);
  df1 = d1 - 2 * (1.25 - x1) * m;
  df2 = d2 - 2 * (1.25 - x2) * m;

  cout
    << "Модуль передачи m: " << m << endl
    << "Число зубьев шестерни z1: " << z1 << endl
    << "Число зубьев колеса z2: " << z2 << endl
    << "Коэфф. смещения колеса x2: " << x2 << endl
    << "Делительный диаметр шестерни d1: " << d1 << endl
    << "Делительный диаметр колеса d2: " << d2 << endl
    << "Начальный диаметр шестерни dw1: " << dw1 << endl
    << "Начальный диаметр колеса dw2: " << dw2 << endl
    << "Делительное межосевое расстояние a: " << a << endl
    << "Угол профиля зуба at: " << at << endl
    << "Угол зацепления atw: " << atw << endl
    << "Коэфф. воспринимающего смещения y: " << y << endl
    << "Коэфф. уравнительного смещения: del_y: " << del_y << endl
    << "Диаметр вершин зубьев шестерни da1: " << da1 << endl
    << "Диаметр вершин зубьев колеса da2: " << da2 << endl
    << "Диаметр впадин шестерни df1: " << df1 << endl
    << "Диаметр впадин колеса df2: " << df2 << endl;
}

